package com.yhf.test1;

/**
 * Created on 2023/8/15.
 *
 * @author qyjy4737
 */
public class Test260 {
    /**
     * 题目0260-最多几个直角三角形
     * 题目描述
     * 有 NNN 条线段，长度分别为 a[1]−a[n]a[1]-a[n]a[1]−a[n]。
     * 现要求你计算这 NNN 条线段最多可以组合成几个直角三角形。
     * 每条线段只能使用一次，每个三角形包含三条线段。
     *
     * 输入描述
     * 第一行输入一个正整数 T(1≤T≤100)T(1 \leq T \leq 100)T(1≤T≤100)，表示有 TTT 组测试数据.
     * 对于每组测试数据，接下来有TTT行，
     * 每行第一个正整数 NNN，表示线段个数 (3≤N≤20)(3 \leq N \leq 20)(3≤N≤20)，接着是 NNN 个正整数，表示每条线段长度，(0<a[i]<100)(0 < a[i] < 100)(0<a[i]<100)。
     *
     * 输出描述
     * 对于每组测试数据输出一行，每行包括一个整数，表示最多能组合的直角三角形个数
     *
     * 示例一
     * 输入
     * 1
     * 7 3 4 5 6 5 12 13
     * 输出
     * 2
     * 说明
     * 可以组成2个直角三角形（3，4，5）、（5，12，13）
     *
     * ¶思路解析和复杂度分析
     */
}
